app/controllers/students_controller.rb

  def create
    @student = Student.new(post_params)
    @student.save
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-07-29 10:08:58.834441"], ["updated_at", "2018-07-29 10:08:58.834441"]]

  def update
    find_student.update(post_params)
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2018-07-29 10:11:48.576318"], ["id", 1]]